org/emacs-golf.org
#+TITLE: Emacs Golf
* Challenge: https://www.vimgolf.com/challenges/53b473a3ac0ceb00022303bd
    Solution:
        C-k M-& v i <return> s-' C-y C-j C-j <return> M-w
        s-' C-y M-9 <backspace> 
    Keystrokes: 15
* Challenge: https://www.vimgolf.com/challenges/4d1c27940e3d7832db000010
    Solution: <insert> C-x * c 2 <return> F3 <return> k n M-9 M-9 C-x ) M-0 y
    Keystrokes: 16
    Solution 2: C-k C-x * c 2 <return> F3 M-1 y k n M-1 M-0 M-0 C-x )
* Challenge: https://www.vimgolf.com/challenges/55b18bbea9c2c30d04000001
    Solution:
        C-s r M-w M-e <return> C-y 7 SPC 1 1 M-e <return>
        <return> N e w SPC t e x t .
    Keystrokes: 22
* Challenge: https://www.vimgolf.com/challenges/5cf62aa56c09760009d6b2f3
    Solution: M-% ) <return> ) ! <return>
    Keystrokes: 7
* Challenge: https://www.vimgolf.com/challenges/5c742a5a50bdf70006d43280
    Solution:
        M-3 M-1 # <return> # SPC M-3 M-f M-DEL w a s C-e SPC #
        <return> M-3 M-1 #
    Keystrokes: 19
* Challenge: https://www.vimgolf.com/challenges/56fb2e75ccffcc0009026473
    Solution:
        M-2 C-k M-% , <return> C-q C-j <return> M-a DEL
        M-a DEL
    Keystrokes: 12
* Challenge: https://www.vimgolf.com/challenges/5d7f565deac0df000cfc2154
    Solution: : F3
        M-3 C-d C-n C-x ) M-7 - RET C-n F4 M-DEL A r e C-n M-3 - RET
        C-n F4 d RET M-9 -
    Keystrokes: 25
* Challenge: https://www.vimgolf.com/challenges/5192f96ad8df110002000002
    Solution: F3
        ( M-f ) C-f M-3 C-x )
    Keystrokes: 8
* Challenge: https://www.vimgolf.com/challenges/52c3cb0d9b8634000200000e
    Solution:
        M-4 M-f M-DEL M-DEL N E W M-f M-f DEL 4
    Keystrokes: 11
* Challenge: https://www.vimgolf.com/challenges/540629666a1e4000020d9e5a
    Solution: : F3
        - C-f M-1 M-4 C-x
    Keystrokes: 7
