emacs-golf.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-05-02 Sat 10:28 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Emacs Golf</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Tanner Hoelzel" />
</head>
<body>
<div id="content">
<h1 class="title">Emacs Golf</h1>
<div id="outline-container-orgdf441c1" class="outline-2">
<h2 id="orgdf441c1">Challenge: <a href="https://www.vimgolf.com/challenges/53b473a3ac0ceb00022303bd">https://www.vimgolf.com/challenges/53b473a3ac0ceb00022303bd</a></h2>
<div class="outline-text-2" id="text-orgdf441c1">
<p>
Solution:
    C-k M-&amp; v i &lt;return&gt; s-' C-y C-j C-j &lt;return&gt; M-w
    s-' C-y M-9 &lt;backspace&gt; 
Keystrokes: 15
</p>
</div>
</div>
<div id="outline-container-org0a65ef8" class="outline-2">
<h2 id="org0a65ef8">Challenge: <a href="https://www.vimgolf.com/challenges/4d1c27940e3d7832db000010">https://www.vimgolf.com/challenges/4d1c27940e3d7832db000010</a></h2>
<div class="outline-text-2" id="text-org0a65ef8">
<p>
Solution: &lt;insert&gt; C-x * c 2 &lt;return&gt; F3 &lt;return&gt; k n M-9 M-9 C-x ) M-0 y
Keystrokes: 16
Solution 2: C-k C-x * c 2 &lt;return&gt; F3 M-1 y k n M-1 M-0 M-0 C-x )
</p>
</div>
</div>
<div id="outline-container-orgeb3d710" class="outline-2">
<h2 id="orgeb3d710">Challenge: <a href="https://www.vimgolf.com/challenges/55b18bbea9c2c30d04000001">https://www.vimgolf.com/challenges/55b18bbea9c2c30d04000001</a></h2>
<div class="outline-text-2" id="text-orgeb3d710">
<p>
Solution:
    C-s r M-w M-e &lt;return&gt; C-y 7 SPC 1 1 M-e &lt;return&gt;
    &lt;return&gt; N e w SPC t e x t .
Keystrokes: 22
</p>
</div>
</div>
<div id="outline-container-orgf690061" class="outline-2">
<h2 id="orgf690061">Challenge: <a href="https://www.vimgolf.com/challenges/5cf62aa56c09760009d6b2f3">https://www.vimgolf.com/challenges/5cf62aa56c09760009d6b2f3</a></h2>
<div class="outline-text-2" id="text-orgf690061">
<p>
Solution: M-% ) &lt;return&gt; ) ! &lt;return&gt;
Keystrokes: 7
</p>
</div>
</div>
<div id="outline-container-org1a89b3e" class="outline-2">
<h2 id="org1a89b3e">Challenge: <a href="https://www.vimgolf.com/challenges/5c742a5a50bdf70006d43280">https://www.vimgolf.com/challenges/5c742a5a50bdf70006d43280</a></h2>
<div class="outline-text-2" id="text-org1a89b3e">
<p>
Solution:
    M-3 M-1 # &lt;return&gt; # SPC M-3 M-f M-DEL w a s C-e SPC #
    &lt;return&gt; M-3 M-1 #
Keystrokes: 19
</p>
</div>
</div>
<div id="outline-container-org9a87d27" class="outline-2">
<h2 id="org9a87d27">Challenge: <a href="https://www.vimgolf.com/challenges/56fb2e75ccffcc0009026473">https://www.vimgolf.com/challenges/56fb2e75ccffcc0009026473</a></h2>
<div class="outline-text-2" id="text-org9a87d27">
<p>
Solution:
    M-2 C-k M-% , &lt;return&gt; C-q C-j &lt;return&gt; M-a DEL
    M-a DEL
Keystrokes: 12
</p>
</div>
</div>
<div id="outline-container-orgea1ed9d" class="outline-2">
<h2 id="orgea1ed9d">Challenge: <a href="https://www.vimgolf.com/challenges/5d7f565deac0df000cfc2154">https://www.vimgolf.com/challenges/5d7f565deac0df000cfc2154</a></h2>
<div class="outline-text-2" id="text-orgea1ed9d">
<p>
Solution: : F3
    M-3 C-d C-n C-x ) M-7 - RET C-n F4 M-DEL A r e C-n M-3 - RET
    C-n F4 d RET M-9 -
Keystrokes: 25
</p>
</div>
</div>
<div id="outline-container-org2c53bac" class="outline-2">
<h2 id="org2c53bac">Challenge: <a href="https://www.vimgolf.com/challenges/5192f96ad8df110002000002">https://www.vimgolf.com/challenges/5192f96ad8df110002000002</a></h2>
<div class="outline-text-2" id="text-org2c53bac">
<p>
Solution: F3
    ( M-f ) C-f M-3 C-x )
Keystrokes: 8
</p>
</div>
</div>
<div id="outline-container-orgcefb197" class="outline-2">
<h2 id="orgcefb197">Challenge: <a href="https://www.vimgolf.com/challenges/52c3cb0d9b8634000200000e">https://www.vimgolf.com/challenges/52c3cb0d9b8634000200000e</a></h2>
<div class="outline-text-2" id="text-orgcefb197">
<p>
Solution:
    M-4 M-f M-DEL M-DEL N E W M-f M-f DEL 4
Keystrokes: 11
</p>
</div>
</div>
<div id="outline-container-org65befb7" class="outline-2">
<h2 id="org65befb7">Challenge: <a href="https://www.vimgolf.com/challenges/540629666a1e4000020d9e5a">https://www.vimgolf.com/challenges/540629666a1e4000020d9e5a</a></h2>
<div class="outline-text-2" id="text-org65befb7">
<p>
Solution: : F3
</p>
<ul class="org-ul">
<li>C-f M-1 M-4 C-x</li>
</ul>
<p>
Keystrokes: 7
</p>
</div>
</div>
</div>
</body>
</html>
